function la=laplace(u)
global n1 n2
%%%%%%%%%%%%%%%%%%%%%%%Euler法求u%%%%%%%%%%%%%%%%%%%%%%%%
for i=2:n1-1
    for j=2:n2-1
        la(i,j)=u(i+1,j)+u(i-1,j)+u(i,j+1)+u(i,j-1)-4*u(i,j);
    end
end
%%%%%%%%%%%%%%%%%%%%%%%u值的初始条件%%%%%%%%%%%%%%%%%%%%%%
la(1,1)=2.*u(1,2)+2.*u(2,1)-4.*u(1,1);
la(1,n2)=2*u(1,n2-1)+2*u(2,n2)-4*u(1,n2);
la(n1,1)=2*u(n1,2)+2*u(n1-1,1)-4*u(n1,n2);
la(n1,n2)=2*u(n1,n2-1)+2*u(n1-1,n2)-4*u(n1,n2);

for j=2:n2-1
    la(1,j)=u(1,j-1)+u(1,j+1)+2*u(2,j)-4*u(1,j);
    la(n1,j)=u(n1,j-1)+u(n1,j+1)+2*u(n1-1,j)-4*u(n1,j);
end

for i=2:n1-1
    la(i,1)=u(i-1,1)+u(i+1,1)+2*u(i,2)-4*u(i,1);
    la(i,n2)=u(i-1,n2)+u(i+1,n2)+2*u(i,n2-1)-4*u(i,n2);
end
end