clc;clear all
N = 21;
h = 1./(N-1);
dt = 0.00051;
P = dt./(h.^2);
Tspan = 220;
phi = zeros(N,Tspan);

for i = 2:N-1
    x(i) = (i-1).*h;
    phi(i,1) = x(i).*(1-x(i));
end
%%%%%%%%%%%%%%%%%%%%%%%%%%初始条件%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x(1) = 0;
x(N) = 1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%迭代%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
for i = 1:Tspan;
    for j = 2:N-1
        phi(j,i+1) = phi(j,i)+P.*(phi(j-1,i)+phi(j+1,i)...
            -2.*phi(j,i));
    end
    sum_of_square(i) = 0;
%%%%%%%%%%%%%%%%%%%%%%%%%%归一化%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    for j = 1:N-1
        sum_of_square(i) = sum_of_square(i)+phi(j,i).^2.*h;
    end
   
    for m = 1:N
        phi(m,i) = (phi(m,i).^2./sum_of_square(i)).^(1/2);
    end
%%%%%%%%%%%%%%%%%%%%%%%%%%画图（扩散过程）%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%  
    plot(x,phi(:,i)),pause(0.05)
    
%%%%%%%%%%%%%%%%%%%%%%%%%%求本征值的演化过程%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    E = 0;
    for k = 2:N
        E = E+(phi(k,i)-phi(k-1,i)).^2;
    end
    energy_value_num(i) = E./h;
end

